УНФ_ТЕСТ/src/Catalogs/КарточкиАнализаБизнеса/КарточкиАнализаБизнеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КарточкиАнализаБизнеса</name>
  <attributes>
    <name>ВидКарточки</name>
    <type>
      <types>EnumRef.ВидыКарточекАнализаБизнеса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательБизнеса</name>
    <type>
      <types>CatalogRef.ПоказателиБизнеса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверки</name>
    <type>
      <types>EnumRef.ВариантыПроверокАнализаБизнеса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравненияЗначений</name>
    <type>
      <types>EnumRef.ВидСравненияЗначений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеДляСравнения</name>
    <type>
      <types>CatalogRef.ПоказателиБизнеса</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИзменения</name>
    <type>
      <types>EnumRef.ИзменениеЗначенияПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоложительныйРезультат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтрицательныйРезультат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОписаниеПроверки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>EnumRef.ДоступныеПериодыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяСтрокаЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВтораяСтрокаЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПредыдущийПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Enums/ВидыКарточекАнализаБизнеса/ВидыКарточекАнализаБизнеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКарточекАнализаБизнеса</name>
  <enumValues>
    <name>Цель</name>
  </enumValues>
  <enumValues>
    <name>КонтрольПоказателей</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВариантыПроверокАнализаБизнеса/ВариантыПроверокАнализаБизнеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПроверокАнализаБизнеса</name>
  <enumValues>
    <name>Динамика</name>
  </enumValues>
  <enumValues>
    <name>СравнениеСФиксированнымЗначением</name>
  </enumValues>
  <enumValues>
    <name>СравнениеСПоказателем</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/КарточкиАнализаБизнеса/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.КонтрольПоказателей Тогда
		
		Если ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.СравнениеСПоказателем
			ИЛИ ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.СравнениеСФиксированнымЗначением Тогда
			
			Если Период = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			ИначеЕсли Период = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда
				Периодичность = Перечисления.Периодичность.Квартал;
			ИначеЕсли Период = Перечисления.ДоступныеПериодыОтчета.Полугодие Тогда
				Периодичность = Перечисления.Периодичность.Полугодие;
			Иначе // Год
				Периодичность = Перечисления.Периодичность.Год;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидКарточки = Перечисления.ВидыКарточекАнализаБизнеса.Цель Тогда
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВариантПроверки");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидСравненияЗначений");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ЗначениеДляСравнения");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидИзменения");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Период");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Периодичность");
		
	Иначе // Проверки
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СценарийПланирования");
		
		Если ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.Динамика Тогда
			
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидСравненияЗначений");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ЗначениеДляСравнения");
			
			
		ИначеЕсли ВариантПроверки = Перечисления.ВариантыПроверокАнализаБизнеса.СравнениеСПоказателем Тогда
			
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидИзменения");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Периодичность");
			
		Иначе // Сравнение с числом 
			
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидИзменения");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Периодичность");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ЗначениеДляСравнения");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
